# ShowBlankLine Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSortGroupField..::..ShowBlankLine Property
ScheduleSortGroupField Class See Also
---
Indicates if an empty row should be displayed between groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowBlankLine { get; set; }
```

Visual Basic
---
```text
Public Property ShowBlankLine As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowBlankLine {
	bool get ();
	void set (bool value);
}
```

# Remarks
True if an empty row should be displayed, false otherwise.
# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace